Revit 2027 API
LabelUtils.GetLabelForGroup Method
 Gets the user-visible name for a built-in parameter group. To get the name of parameter group "Other", pass an empty, default-constructed ForgeTypeId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetLabelForGroup(
	ForgeTypeId groupTypeId
)
Public Shared Function GetLabelForGroup (
	groupTypeId As ForgeTypeId
) As String
public:
static String^ GetLabelForGroup(
	ForgeTypeId^ groupTypeId
)
static member GetLabelForGroup :
        groupTypeId : ForgeTypeId -> string
Parameters
groupTypeId ForgeTypeId
 The identifier of the parameter group to get the user-visible name, or an empty ForgeTypeId for group "Other".
Return Value
String
Remarks
 The name is obtained in the current Revit language.
See Also
Reference
LabelUtils Class
Autodesk.Revit.DB Namespace